int a = 5,  b = 7,  c = 2,   d = 10,  e = -9,   f = -3;



if (a > b)
{
    Console.WriteLine("Первое максимальное число: " + a + ", первое минимальное число: " + b);
}

else
{
    Console.WriteLine("Первое максимальное число: " + b + ", первое минимальное число: " + a);
}



if (c > d)
{
    Console.WriteLine("Второе максимальное число: " + c + ", второе минимальнок число: " + d);
}

else
{
    Console.WriteLine("Второе максимальное число: " + d + ", второе минимальнок число: " + c);
}



if (e > f)
{
    Console.WriteLine("Третье максимальное число: " + e + ", третье минимальнок число: " + f);
}

else
{
    Console.WriteLine("Третье максимальное число: " + f + ", третье минимальнок число: " + e);
}